// mojo/public/cpp/bindings/tests/module_to_downgrade.test-mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef MOJO_PUBLIC_CPP_BINDINGS_TESTS_MODULE_TO_DOWNGRADE_TEST_MOJOM_PARAMS_DATA_H_
#define MOJO_PUBLIC_CPP_BINDINGS_TESTS_MODULE_TO_DOWNGRADE_TEST_MOJOM_PARAMS_DATA_H_

#include "base/macros.h"
#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"
#include "mojo/public/cpp/bindings/lib/validation_context.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace mojo {
namespace test {
namespace mojom_types_downgrader_unittest {
namespace mojom {
namespace internal {
class  Foo_DummyMethod_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<Foo_DummyMethod_Params_Data>;

  Foo_DummyMethod_Params_Data();
  ~Foo_DummyMethod_Params_Data() = delete;
};
static_assert(sizeof(Foo_DummyMethod_Params_Data) == 8,
              "Bad sizeof(Foo_DummyMethod_Params_Data)");
class  DowngradedTestInterface_InterfaceRequest_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data request;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<DowngradedTestInterface_InterfaceRequest_Params_Data>;

  DowngradedTestInterface_InterfaceRequest_Params_Data();
  ~DowngradedTestInterface_InterfaceRequest_Params_Data() = delete;
};
static_assert(sizeof(DowngradedTestInterface_InterfaceRequest_Params_Data) == 16,
              "Bad sizeof(DowngradedTestInterface_InterfaceRequest_Params_Data)");
class  DowngradedTestInterface_InterfacePtr_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data ptr;

 private:
  friend class mojo::internal::MessageFragment<DowngradedTestInterface_InterfacePtr_Params_Data>;

  DowngradedTestInterface_InterfacePtr_Params_Data();
  ~DowngradedTestInterface_InterfacePtr_Params_Data() = delete;
};
static_assert(sizeof(DowngradedTestInterface_InterfacePtr_Params_Data) == 16,
              "Bad sizeof(DowngradedTestInterface_InterfacePtr_Params_Data)");
class  DowngradedTestInterface_AssociatedInterfacePtrInfo_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::AssociatedInterface_Data associated_ptr_info;

 private:
  friend class mojo::internal::MessageFragment<DowngradedTestInterface_AssociatedInterfacePtrInfo_Params_Data>;

  DowngradedTestInterface_AssociatedInterfacePtrInfo_Params_Data();
  ~DowngradedTestInterface_AssociatedInterfacePtrInfo_Params_Data() = delete;
};
static_assert(sizeof(DowngradedTestInterface_AssociatedInterfacePtrInfo_Params_Data) == 16,
              "Bad sizeof(DowngradedTestInterface_AssociatedInterfacePtrInfo_Params_Data)");
class  DowngradedTestInterface_AssociatedInterfaceRequest_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::AssociatedEndpointHandle_Data associated_request;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<DowngradedTestInterface_AssociatedInterfaceRequest_Params_Data>;

  DowngradedTestInterface_AssociatedInterfaceRequest_Params_Data();
  ~DowngradedTestInterface_AssociatedInterfaceRequest_Params_Data() = delete;
};
static_assert(sizeof(DowngradedTestInterface_AssociatedInterfaceRequest_Params_Data) == 16,
              "Bad sizeof(DowngradedTestInterface_AssociatedInterfaceRequest_Params_Data)");
class  DowngradedTestInterface_PendingReceiver_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<DowngradedTestInterface_PendingReceiver_Params_Data>;

  DowngradedTestInterface_PendingReceiver_Params_Data();
  ~DowngradedTestInterface_PendingReceiver_Params_Data() = delete;
};
static_assert(sizeof(DowngradedTestInterface_PendingReceiver_Params_Data) == 16,
              "Bad sizeof(DowngradedTestInterface_PendingReceiver_Params_Data)");
class  DowngradedTestInterface_PendingRemote_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data remote;

 private:
  friend class mojo::internal::MessageFragment<DowngradedTestInterface_PendingRemote_Params_Data>;

  DowngradedTestInterface_PendingRemote_Params_Data();
  ~DowngradedTestInterface_PendingRemote_Params_Data() = delete;
};
static_assert(sizeof(DowngradedTestInterface_PendingRemote_Params_Data) == 16,
              "Bad sizeof(DowngradedTestInterface_PendingRemote_Params_Data)");
class  DowngradedTestInterface_PendingAssociatedReceiver_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::AssociatedEndpointHandle_Data associated_remote;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<DowngradedTestInterface_PendingAssociatedReceiver_Params_Data>;

  DowngradedTestInterface_PendingAssociatedReceiver_Params_Data();
  ~DowngradedTestInterface_PendingAssociatedReceiver_Params_Data() = delete;
};
static_assert(sizeof(DowngradedTestInterface_PendingAssociatedReceiver_Params_Data) == 16,
              "Bad sizeof(DowngradedTestInterface_PendingAssociatedReceiver_Params_Data)");
class  DowngradedTestInterface_PendingAssociatedRemote_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::AssociatedInterface_Data associated_receiver;

 private:
  friend class mojo::internal::MessageFragment<DowngradedTestInterface_PendingAssociatedRemote_Params_Data>;

  DowngradedTestInterface_PendingAssociatedRemote_Params_Data();
  ~DowngradedTestInterface_PendingAssociatedRemote_Params_Data() = delete;
};
static_assert(sizeof(DowngradedTestInterface_PendingAssociatedRemote_Params_Data) == 16,
              "Bad sizeof(DowngradedTestInterface_PendingAssociatedRemote_Params_Data)");
class  DowngradedTestInterface_MultipleParams2_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data remote;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<DowngradedTestInterface_MultipleParams2_Params_Data>;

  DowngradedTestInterface_MultipleParams2_Params_Data();
  ~DowngradedTestInterface_MultipleParams2_Params_Data() = delete;
};
static_assert(sizeof(DowngradedTestInterface_MultipleParams2_Params_Data) == 24,
              "Bad sizeof(DowngradedTestInterface_MultipleParams2_Params_Data)");
class  DowngradedTestInterface_MultipleParams3_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data remote;
  mojo::internal::Handle_Data receiver;
  mojo::internal::AssociatedInterface_Data associated_remote;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<DowngradedTestInterface_MultipleParams3_Params_Data>;

  DowngradedTestInterface_MultipleParams3_Params_Data();
  ~DowngradedTestInterface_MultipleParams3_Params_Data() = delete;
};
static_assert(sizeof(DowngradedTestInterface_MultipleParams3_Params_Data) == 32,
              "Bad sizeof(DowngradedTestInterface_MultipleParams3_Params_Data)");
class  DowngradedTestInterface_MultipleParams4_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data remote;
  mojo::internal::Handle_Data receiver;
  mojo::internal::AssociatedInterface_Data associated_remote;
  mojo::internal::AssociatedEndpointHandle_Data associated_receiver;

 private:
  friend class mojo::internal::MessageFragment<DowngradedTestInterface_MultipleParams4_Params_Data>;

  DowngradedTestInterface_MultipleParams4_Params_Data();
  ~DowngradedTestInterface_MultipleParams4_Params_Data() = delete;
};
static_assert(sizeof(DowngradedTestInterface_MultipleParams4_Params_Data) == 32,
              "Bad sizeof(DowngradedTestInterface_MultipleParams4_Params_Data)");
class  DowngradedTestInterface_MethodWithResponseCallbackOneLine_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data data;

 private:
  friend class mojo::internal::MessageFragment<DowngradedTestInterface_MethodWithResponseCallbackOneLine_Params_Data>;

  DowngradedTestInterface_MethodWithResponseCallbackOneLine_Params_Data();
  ~DowngradedTestInterface_MethodWithResponseCallbackOneLine_Params_Data() = delete;
};
static_assert(sizeof(DowngradedTestInterface_MethodWithResponseCallbackOneLine_Params_Data) == 16,
              "Bad sizeof(DowngradedTestInterface_MethodWithResponseCallbackOneLine_Params_Data)");
class  DowngradedTestInterface_MethodWithResponseCallbackOneLine_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<DowngradedTestInterface_MethodWithResponseCallbackOneLine_ResponseParams_Data>;

  DowngradedTestInterface_MethodWithResponseCallbackOneLine_ResponseParams_Data();
  ~DowngradedTestInterface_MethodWithResponseCallbackOneLine_ResponseParams_Data() = delete;
};
static_assert(sizeof(DowngradedTestInterface_MethodWithResponseCallbackOneLine_ResponseParams_Data) == 8,
              "Bad sizeof(DowngradedTestInterface_MethodWithResponseCallbackOneLine_ResponseParams_Data)");
class  DowngradedTestInterface_MethodWithResponseCallbackTwoLines_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data data;

 private:
  friend class mojo::internal::MessageFragment<DowngradedTestInterface_MethodWithResponseCallbackTwoLines_Params_Data>;

  DowngradedTestInterface_MethodWithResponseCallbackTwoLines_Params_Data();
  ~DowngradedTestInterface_MethodWithResponseCallbackTwoLines_Params_Data() = delete;
};
static_assert(sizeof(DowngradedTestInterface_MethodWithResponseCallbackTwoLines_Params_Data) == 16,
              "Bad sizeof(DowngradedTestInterface_MethodWithResponseCallbackTwoLines_Params_Data)");
class  DowngradedTestInterface_MethodWithResponseCallbackTwoLines_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<DowngradedTestInterface_MethodWithResponseCallbackTwoLines_ResponseParams_Data>;

  DowngradedTestInterface_MethodWithResponseCallbackTwoLines_ResponseParams_Data();
  ~DowngradedTestInterface_MethodWithResponseCallbackTwoLines_ResponseParams_Data() = delete;
};
static_assert(sizeof(DowngradedTestInterface_MethodWithResponseCallbackTwoLines_ResponseParams_Data) == 16,
              "Bad sizeof(DowngradedTestInterface_MethodWithResponseCallbackTwoLines_ResponseParams_Data)");
class  DowngradedTestInterface_OddSpaces_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data remote;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<DowngradedTestInterface_OddSpaces_Params_Data>;

  DowngradedTestInterface_OddSpaces_Params_Data();
  ~DowngradedTestInterface_OddSpaces_Params_Data() = delete;
};
static_assert(sizeof(DowngradedTestInterface_OddSpaces_Params_Data) == 24,
              "Bad sizeof(DowngradedTestInterface_OddSpaces_Params_Data)");
class  DowngradedTestInterface_OddSpacesAndLineBreak_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data remote;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<DowngradedTestInterface_OddSpacesAndLineBreak_Params_Data>;

  DowngradedTestInterface_OddSpacesAndLineBreak_Params_Data();
  ~DowngradedTestInterface_OddSpacesAndLineBreak_Params_Data() = delete;
};
static_assert(sizeof(DowngradedTestInterface_OddSpacesAndLineBreak_Params_Data) == 24,
              "Bad sizeof(DowngradedTestInterface_OddSpacesAndLineBreak_Params_Data)");

}  // namespace internal


class Foo_DummyMethod_ParamsDataView {
 public:
  Foo_DummyMethod_ParamsDataView() {}

  Foo_DummyMethod_ParamsDataView(
      internal::Foo_DummyMethod_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::Foo_DummyMethod_Params_Data* data_ = nullptr;
};



class DowngradedTestInterface_InterfaceRequest_ParamsDataView {
 public:
  DowngradedTestInterface_InterfaceRequest_ParamsDataView() {}

  DowngradedTestInterface_InterfaceRequest_ParamsDataView(
      internal::DowngradedTestInterface_InterfaceRequest_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  template <typename UserType>
  UserType TakeRequest() {
