// mojo/public/interfaces/bindings/tests/math_calculator.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef MOJO_PUBLIC_INTERFACES_BINDINGS_TESTS_MATH_CALCULATOR_MOJOM_PARAMS_DATA_H_
#define MOJO_PUBLIC_INTERFACES_BINDINGS_TESTS_MATH_CALCULATOR_MOJOM_PARAMS_DATA_H_

#include "base/macros.h"
#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"
#include "mojo/public/cpp/bindings/lib/validation_context.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace math {
namespace internal {
class  Calculator_Clear_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<Calculator_Clear_Params_Data>;

  Calculator_Clear_Params_Data();
  ~Calculator_Clear_Params_Data() = delete;
};
static_assert(sizeof(Calculator_Clear_Params_Data) == 8,
              "Bad sizeof(Calculator_Clear_Params_Data)");
class  Calculator_Clear_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  double value;

 private:
  friend class mojo::internal::MessageFragment<Calculator_Clear_ResponseParams_Data>;

  Calculator_Clear_ResponseParams_Data();
  ~Calculator_Clear_ResponseParams_Data() = delete;
};
static_assert(sizeof(Calculator_Clear_ResponseParams_Data) == 16,
              "Bad sizeof(Calculator_Clear_ResponseParams_Data)");
class  Calculator_Add_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  double value;

 private:
  friend class mojo::internal::MessageFragment<Calculator_Add_Params_Data>;

  Calculator_Add_Params_Data();
  ~Calculator_Add_Params_Data() = delete;
};
static_assert(sizeof(Calculator_Add_Params_Data) == 16,
              "Bad sizeof(Calculator_Add_Params_Data)");
class  Calculator_Add_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  double value;

 private:
  friend class mojo::internal::MessageFragment<Calculator_Add_ResponseParams_Data>;

  Calculator_Add_ResponseParams_Data();
  ~Calculator_Add_ResponseParams_Data() = delete;
};
static_assert(sizeof(Calculator_Add_ResponseParams_Data) == 16,
              "Bad sizeof(Calculator_Add_ResponseParams_Data)");
class  Calculator_Multiply_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  double value;

 private:
  friend class mojo::internal::MessageFragment<Calculator_Multiply_Params_Data>;

  Calculator_Multiply_Params_Data();
  ~Calculator_Multiply_Params_Data() = delete;
};
static_assert(sizeof(Calculator_Multiply_Params_Data) == 16,
              "Bad sizeof(Calculator_Multiply_Params_Data)");
class  Calculator_Multiply_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  double value;

 private:
  friend class mojo::internal::MessageFragment<Calculator_Multiply_ResponseParams_Data>;

  Calculator_Multiply_ResponseParams_Data();
  ~Calculator_Multiply_ResponseParams_Data() = delete;
};
static_assert(sizeof(Calculator_Multiply_ResponseParams_Data) == 16,
              "Bad sizeof(Calculator_Multiply_ResponseParams_Data)");

}  // namespace internal


class Calculator_Clear_ParamsDataView {
 public:
  Calculator_Clear_ParamsDataView() {}

  Calculator_Clear_ParamsDataView(
      internal::Calculator_Clear_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::Calculator_Clear_Params_Data* data_ = nullptr;
};



class Calculator_Clear_ResponseParamsDataView {
 public:
  Calculator_Clear_ResponseParamsDataView() {}

  Calculator_Clear_ResponseParamsDataView(
      internal::Calculator_Clear_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
  double value() const {
    return data_->value;
  }
 private:
  internal::Calculator_Clear_ResponseParams_Data* data_ = nullptr;
};



class Calculator_Add_ParamsDataView {
 public:
  Calculator_Add_ParamsDataView() {}

  Calculator_Add_ParamsDataView(
      internal::Calculator_Add_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
  double value() const {
    return data_->value;
  }
 private:
  internal::Calculator_Add_Params_Data* data_ = nullptr;
};



class Calculator_Add_ResponseParamsDataView {
 public:
  Calculator_Add_ResponseParamsDataView() {}

  Calculator_Add_ResponseParamsDataView(
      internal::Calculator_Add_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
  double value() const {
    return data_->value;
  }
 private:
  internal::Calculator_Add_ResponseParams_Data* data_ = nullptr;
};



class Calculator_Multiply_ParamsDataView {
 public:
  Calculator_Multiply_ParamsDataView() {}

  Calculator_Multiply_ParamsDataView(
      internal::Calculator_Multiply_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
  double value() const {
    return data_->value;
  }
 private:
  internal::Calculator_Multiply_Params_Data* data_ = nullptr;
};



class Calculator_Multiply_ResponseParamsDataView {
 public:
  Calculator_Multiply_ResponseParamsDataView() {}

  Calculator_Multiply_ResponseParamsDataView(
      internal::Calculator_Multiply_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
  double value() const {
    return data_->value;
  }
 private:
  internal::Calculator_Multiply_ResponseParams_Data* data_ = nullptr;
};













}  // namespace math

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif  // MOJO_PUBLIC_INTERFACES_BINDINGS_TESTS_MATH_CALCULATOR_MOJOM_PARAMS_DATA_H_