// mojo/public/interfaces/bindings/tests/regression_tests.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef MOJO_PUBLIC_INTERFACES_BINDINGS_TESTS_REGRESSION_TESTS_MOJOM_PARAMS_DATA_H_
#define MOJO_PUBLIC_INTERFACES_BINDINGS_TESTS_REGRESSION_TESTS_MOJOM_PARAMS_DATA_H_

#include "base/macros.h"
#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"
#include "mojo/public/cpp/bindings/lib/validation_context.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace regression_tests {
namespace internal {
class  CheckMethodWithEmptyResponse_WithouParameterAndEmptyResponse_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<CheckMethodWithEmptyResponse_WithouParameterAndEmptyResponse_Params_Data>;

  CheckMethodWithEmptyResponse_WithouParameterAndEmptyResponse_Params_Data();
  ~CheckMethodWithEmptyResponse_WithouParameterAndEmptyResponse_Params_Data() = delete;
};
static_assert(sizeof(CheckMethodWithEmptyResponse_WithouParameterAndEmptyResponse_Params_Data) == 8,
              "Bad sizeof(CheckMethodWithEmptyResponse_WithouParameterAndEmptyResponse_Params_Data)");
class  CheckMethodWithEmptyResponse_WithouParameterAndEmptyResponse_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<CheckMethodWithEmptyResponse_WithouParameterAndEmptyResponse_ResponseParams_Data>;

  CheckMethodWithEmptyResponse_WithouParameterAndEmptyResponse_ResponseParams_Data();
  ~CheckMethodWithEmptyResponse_WithouParameterAndEmptyResponse_ResponseParams_Data() = delete;
};
static_assert(sizeof(CheckMethodWithEmptyResponse_WithouParameterAndEmptyResponse_ResponseParams_Data) == 8,
              "Bad sizeof(CheckMethodWithEmptyResponse_WithouParameterAndEmptyResponse_ResponseParams_Data)");
class  CheckMethodWithEmptyResponse_WithParameterAndEmptyResponse_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t b : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<CheckMethodWithEmptyResponse_WithParameterAndEmptyResponse_Params_Data>;

  CheckMethodWithEmptyResponse_WithParameterAndEmptyResponse_Params_Data();
  ~CheckMethodWithEmptyResponse_WithParameterAndEmptyResponse_Params_Data() = delete;
};
static_assert(sizeof(CheckMethodWithEmptyResponse_WithParameterAndEmptyResponse_Params_Data) == 16,
              "Bad sizeof(CheckMethodWithEmptyResponse_WithParameterAndEmptyResponse_Params_Data)");
class  CheckMethodWithEmptyResponse_WithParameterAndEmptyResponse_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<CheckMethodWithEmptyResponse_WithParameterAndEmptyResponse_ResponseParams_Data>;

  CheckMethodWithEmptyResponse_WithParameterAndEmptyResponse_ResponseParams_Data();
  ~CheckMethodWithEmptyResponse_WithParameterAndEmptyResponse_ResponseParams_Data() = delete;
};
static_assert(sizeof(CheckMethodWithEmptyResponse_WithParameterAndEmptyResponse_ResponseParams_Data) == 8,
              "Bad sizeof(CheckMethodWithEmptyResponse_WithParameterAndEmptyResponse_ResponseParams_Data)");
class  CheckNameCollision_WithNameCollision_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t message : 1;
  uint8_t response : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<CheckNameCollision_WithNameCollision_Params_Data>;

  CheckNameCollision_WithNameCollision_Params_Data();
  ~CheckNameCollision_WithNameCollision_Params_Data() = delete;
};
static_assert(sizeof(CheckNameCollision_WithNameCollision_Params_Data) == 16,
              "Bad sizeof(CheckNameCollision_WithNameCollision_Params_Data)");
class  CheckNameCollision_WithNameCollision_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t message : 1;
  uint8_t response : 1;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<CheckNameCollision_WithNameCollision_ResponseParams_Data>;

  CheckNameCollision_WithNameCollision_ResponseParams_Data();
  ~CheckNameCollision_WithNameCollision_ResponseParams_Data() = delete;
};
static_assert(sizeof(CheckNameCollision_WithNameCollision_ResponseParams_Data) == 16,
              "Bad sizeof(CheckNameCollision_WithNameCollision_ResponseParams_Data)");
class  HandlesNameCollisionInterface_Method_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::EmptyStruct_Data> handles;

 private:
  friend class mojo::internal::MessageFragment<HandlesNameCollisionInterface_Method_Params_Data>;

  HandlesNameCollisionInterface_Method_Params_Data();
  ~HandlesNameCollisionInterface_Method_Params_Data() = delete;
};
static_assert(sizeof(HandlesNameCollisionInterface_Method_Params_Data) == 16,
              "Bad sizeof(HandlesNameCollisionInterface_Method_Params_Data)");
class  HandlesNameCollisionInterface_Method_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data handles;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<HandlesNameCollisionInterface_Method_ResponseParams_Data>;

  HandlesNameCollisionInterface_Method_ResponseParams_Data();
  ~HandlesNameCollisionInterface_Method_ResponseParams_Data() = delete;
};
static_assert(sizeof(HandlesNameCollisionInterface_Method_ResponseParams_Data) == 16,
              "Bad sizeof(HandlesNameCollisionInterface_Method_ResponseParams_Data)");

}  // namespace internal


class CheckMethodWithEmptyResponse_WithouParameterAndEmptyResponse_ParamsDataView {
 public:
  CheckMethodWithEmptyResponse_WithouParameterAndEmptyResponse_ParamsDataView() {}

  CheckMethodWithEmptyResponse_WithouParameterAndEmptyResponse_ParamsDataView(
      internal::CheckMethodWithEmptyResponse_WithouParameterAndEmptyResponse_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::CheckMethodWithEmptyResponse_WithouParameterAndEmptyResponse_Params_Data* data_ = nullptr;
};



class CheckMethodWithEmptyResponse_WithouParameterAndEmptyResponse_ResponseParamsDataView {
 public:
  CheckMethodWithEmptyResponse_WithouParameterAndEmptyResponse_ResponseParamsDataView() {}

  CheckMethodWithEmptyResponse_WithouParameterAndEmptyResponse_ResponseParamsDataView(
      internal::CheckMethodWithEmptyResponse_WithouParameterAndEmptyResponse_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::CheckMethodWithEmptyResponse_WithouParameterAndEmptyResponse_ResponseParams_Data* data_ = nullptr;
};



class CheckMethodWithEmptyResponse_WithParameterAndEmptyResponse_ParamsDataView {
 public:
  CheckMethodWithEmptyResponse_WithParameterAndEmptyResponse_ParamsDataView() {}

  CheckMethodWithEmptyResponse_WithParameterAndEmptyResponse_ParamsDataView(
      internal::CheckMethodWithEmptyResponse_WithParameterAndEmptyResponse_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
  bool b() const {
    return data_->b;
  }
 private:
  internal::CheckMethodWithEmptyResponse_WithParameterAndEmptyResponse_Params_Data* data_ = nullptr;
};



class CheckMethodWithEmptyResponse_WithParameterAndEmptyResponse_ResponseParamsDataView {
 public:
  CheckMethodWithEmptyResponse_WithParameterAndEmptyResponse_ResponseParamsDataView() {}

  CheckMethodWithEmptyResponse_WithParameterAndEmptyResponse_ResponseParamsDataView(
      internal::CheckMethodWithEmptyResponse_WithParameterAndEmptyResponse_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::CheckMethodWithEmptyResponse_WithParameterAndEmptyResponse_ResponseParams_Data* data_ = nullptr;
};



class CheckNameCollision_WithNameCollision_ParamsDataView {
 public:
  CheckNameCollision_WithNameCollision_ParamsDataView() {}

  CheckNameCollision_WithNameCollision_ParamsDataView(
      internal::CheckNameCollision_WithNameCollision_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
  bool message() const {
    return data_->message;
  }
  bool response() const {
    return data_->response;
  }
 private:
  internal::CheckNameCollision_WithNameCollision_Params_Data* data_ = nullptr;
};



class CheckNameCollision_WithNameCollision_ResponseParamsDataView {
 public:
  CheckNameCollision_WithNameCollision_ResponseParamsDataView() {}

  CheckNameCollision_WithNameCollision_ResponseParamsDataView(
      internal::CheckNameCollision_WithNameCollision_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
  bool message() const {
    return data_->message;
  }
  bool response() const {
    return data_->response;
  }
 private:
  internal::CheckNameCollision_WithNameCollision_ResponseParams_Data* data_ = nullptr;
};



class HandlesNameCollisionInterface_Method_ParamsDataView {
 public:
  HandlesNameCollisionInterface_Method_ParamsDataView() {}

  HandlesNameCollisionInterface_Method_ParamsDataView(
      internal::HandlesNameCollisionInterface_Method_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetHandlesDataView(
      EmptyStructDataView* output);

  template <typename UserType>
  WARN_UNUSED_RESULT bool ReadHandles(UserType* output) {
    
    auto* pointer = data_->handles.Get();
    return mojo::internal::Deserialize<::regression_tests::EmptyStructDataView>(
        pointer, output, message_);
  }
 private:
  internal::HandlesNameCollisionInterface_Method_Params_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class HandlesNameCollisionInterface_Method_ResponseParamsDataView {
 public:
  HandlesNameCollisionInterface_Method_ResponseParamsDataView() {}

  HandlesNameCollisionInterface_Method_ResponseParamsDataView(
      internal::HandlesNameCollisionInterface_Method_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  mojo::ScopedHandle TakeHandles() {
    mojo::ScopedHandle result;
    bool ret =
        mojo::internal::Deserialize<mojo::ScopedHandle>(
            &data_->handles, &result, message_);
    DCHECK(ret);
    return result;
  }
 private:
  internal::HandlesNameCollisionInterface_Method_ResponseParams_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};














inline void HandlesNameCollisionInterface_Method_ParamsDataView::GetHandlesDataView(
    EmptyStructDataView* output) {
  auto pointer = data_->handles.Get();
  *output = EmptyStructDataView(pointer, message_);
}



}  // namespace regression_tests

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif  // MOJO_PUBLIC_INTERFACES_BINDINGS_TESTS_REGRESSION_TESTS_MOJOM_PARAMS_DATA_H_