// mojo/public/interfaces/bindings/tests/sample_factory.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef MOJO_PUBLIC_INTERFACES_BINDINGS_TESTS_SAMPLE_FACTORY_MOJOM_PARAMS_DATA_H_
#define MOJO_PUBLIC_INTERFACES_BINDINGS_TESTS_SAMPLE_FACTORY_MOJOM_PARAMS_DATA_H_

#include "base/macros.h"
#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"
#include "mojo/public/cpp/bindings/lib/validation_context.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace sample {
namespace internal {
class  NamedObject_SetName_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> name;

 private:
  friend class mojo::internal::MessageFragment<NamedObject_SetName_Params_Data>;

  NamedObject_SetName_Params_Data();
  ~NamedObject_SetName_Params_Data() = delete;
};
static_assert(sizeof(NamedObject_SetName_Params_Data) == 16,
              "Bad sizeof(NamedObject_SetName_Params_Data)");
class  NamedObject_GetName_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<NamedObject_GetName_Params_Data>;

  NamedObject_GetName_Params_Data();
  ~NamedObject_GetName_Params_Data() = delete;
};
static_assert(sizeof(NamedObject_GetName_Params_Data) == 8,
              "Bad sizeof(NamedObject_GetName_Params_Data)");
class  NamedObject_GetName_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> name;

 private:
  friend class mojo::internal::MessageFragment<NamedObject_GetName_ResponseParams_Data>;

  NamedObject_GetName_ResponseParams_Data();
  ~NamedObject_GetName_ResponseParams_Data() = delete;
};
static_assert(sizeof(NamedObject_GetName_ResponseParams_Data) == 16,
              "Bad sizeof(NamedObject_GetName_ResponseParams_Data)");
class  Factory_DoStuff_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::Request_Data> request;
  mojo::internal::Handle_Data pipe;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<Factory_DoStuff_Params_Data>;

  Factory_DoStuff_Params_Data();
  ~Factory_DoStuff_Params_Data() = delete;
};
static_assert(sizeof(Factory_DoStuff_Params_Data) == 24,
              "Bad sizeof(Factory_DoStuff_Params_Data)");
class  Factory_DoStuff_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::Response_Data> response;
  mojo::internal::Pointer<mojo::internal::String_Data> text;

 private:
  friend class mojo::internal::MessageFragment<Factory_DoStuff_ResponseParams_Data>;

  Factory_DoStuff_ResponseParams_Data();
  ~Factory_DoStuff_ResponseParams_Data() = delete;
};
static_assert(sizeof(Factory_DoStuff_ResponseParams_Data) == 24,
              "Bad sizeof(Factory_DoStuff_ResponseParams_Data)");
class  Factory_DoStuff2_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data pipe;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<Factory_DoStuff2_Params_Data>;

  Factory_DoStuff2_Params_Data();
  ~Factory_DoStuff2_Params_Data() = delete;
};
static_assert(sizeof(Factory_DoStuff2_Params_Data) == 16,
              "Bad sizeof(Factory_DoStuff2_Params_Data)");
class  Factory_DoStuff2_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> text;

 private:
  friend class mojo::internal::MessageFragment<Factory_DoStuff2_ResponseParams_Data>;

  Factory_DoStuff2_ResponseParams_Data();
  ~Factory_DoStuff2_ResponseParams_Data() = delete;
};
static_assert(sizeof(Factory_DoStuff2_ResponseParams_Data) == 16,
              "Bad sizeof(Factory_DoStuff2_ResponseParams_Data)");
class  Factory_CreateNamedObject_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data obj;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<Factory_CreateNamedObject_Params_Data>;

  Factory_CreateNamedObject_Params_Data();
  ~Factory_CreateNamedObject_Params_Data() = delete;
};
static_assert(sizeof(Factory_CreateNamedObject_Params_Data) == 16,
              "Bad sizeof(Factory_CreateNamedObject_Params_Data)");
class  Factory_RequestImportedInterface_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data obj;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<Factory_RequestImportedInterface_Params_Data>;

  Factory_RequestImportedInterface_Params_Data();
  ~Factory_RequestImportedInterface_Params_Data() = delete;
};
static_assert(sizeof(Factory_RequestImportedInterface_Params_Data) == 16,
              "Bad sizeof(Factory_RequestImportedInterface_Params_Data)");
class  Factory_RequestImportedInterface_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data obj;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<Factory_RequestImportedInterface_ResponseParams_Data>;

  Factory_RequestImportedInterface_ResponseParams_Data();
  ~Factory_RequestImportedInterface_ResponseParams_Data() = delete;
};
static_assert(sizeof(Factory_RequestImportedInterface_ResponseParams_Data) == 16,
              "Bad sizeof(Factory_RequestImportedInterface_ResponseParams_Data)");
class  Factory_TakeImportedInterface_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data obj;

 private:
  friend class mojo::internal::MessageFragment<Factory_TakeImportedInterface_Params_Data>;

  Factory_TakeImportedInterface_Params_Data();
  ~Factory_TakeImportedInterface_Params_Data() = delete;
};
static_assert(sizeof(Factory_TakeImportedInterface_Params_Data) == 16,
              "Bad sizeof(Factory_TakeImportedInterface_Params_Data)");
class  Factory_TakeImportedInterface_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data obj;

 private:
  friend class mojo::internal::MessageFragment<Factory_TakeImportedInterface_ResponseParams_Data>;

  Factory_TakeImportedInterface_ResponseParams_Data();
  ~Factory_TakeImportedInterface_ResponseParams_Data() = delete;
};
static_assert(sizeof(Factory_TakeImportedInterface_ResponseParams_Data) == 16,
              "Bad sizeof(Factory_TakeImportedInterface_ResponseParams_Data)");

}  // namespace internal


class NamedObject_SetName_ParamsDataView {
 public:
  NamedObject_SetName_ParamsDataView() {}

  NamedObject_SetName_ParamsDataView(
      internal::NamedObject_SetName_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetNameDataView(
      mojo::StringDataView* output);

  template <typename UserType>
  WARN_UNUSED_RESULT bool ReadName(UserType* output) {
    
    auto* pointer = data_->name.Get();
    return mojo::internal::Deserialize<mojo::StringDataView>(
        pointer, output, message_);
  }
 private:
  internal::NamedObject_SetName_Params_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class NamedObject_GetName_ParamsDataView {
 public:
  NamedObject_GetName_ParamsDataView() {}

  NamedObject_GetName_ParamsDataView(
      internal::NamedObject_GetName_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::NamedObject_GetName_Params_Data* data_ = nullptr;
};



class NamedObject_GetName_ResponseParamsDataView {
 public:
  NamedObject_GetName_ResponseParamsDataView() {}

  NamedObject_GetName_ResponseParamsDataView(
      internal::NamedObject_GetName_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetNameDataView(
      mojo::StringDataView* output);

  template <typename UserType>
  WARN_UNUSED_RESULT bool ReadName(UserType* output) {
    
    auto* pointer = data_->name.Get();
    return mojo::internal::Deserialize<mojo::StringDataView>(
        pointer, output, message_);
  }
 private:
  internal::NamedObject_GetName_ResponseParams_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class Factory_DoStuff_ParamsDataView {
 public:
  Factory_DoStuff_ParamsDataView() {}

  Factory_DoStuff_ParamsDataView(
      internal::Factory_DoStuff_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetRequestDataView(
      RequestDataView* output);

  template <typename UserType>
  WARN_UNUSED_RESULT bool ReadRequest(UserType* output) {
    
    auto* pointer = data_->request.Get();
    return mojo::internal::Deserialize<::sample::RequestDataView>(
        pointer, output, message_);
  }
  mojo::ScopedMessagePipeHandle TakePipe() {
    mojo::ScopedMessagePipeHandle result;
    bool ret =
        mojo::internal::Deserialize<mojo::ScopedMessagePipeHandle>(
            &data_->pipe, &result, message_);
    DCHECK(ret);
    return result;
  }
 private:
  internal::Factory_DoStuff_Params_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class Factory_DoStuff_ResponseParamsDataView {
 public:
  Factory_DoStuff_ResponseParamsDataView() {}

  Factory_DoStuff_ResponseParamsDataView(
      internal::Factory_DoStuff_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetResponseDataView(
      ResponseDataView* output);

  template <typename UserType>
  WARN_UNUSED_RESULT bool ReadResponse(UserType* output) {
    
    auto* pointer = data_->response.Get();
    return mojo::internal::Deserialize<::sample::ResponseDataView>(
        pointer, output, message_);
  }
  inline void GetTextDataView(
      mojo::StringDataView* output);

  template <typename UserType>
  WARN_UNUSED_RESULT bool ReadText(UserType* output) {
    
    auto* pointer = data_->text.Get();
    return mojo::internal::Deserialize<mojo::StringDataView>(
        pointer, output, message_);
  }
 private:
  internal::Factory_DoStuff_ResponseParams_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class Factory_DoStuff2_ParamsDataView {
 public:
  Factory_DoStuff2_ParamsDataView() {}

  Factory_DoStuff2_ParamsDataView(
      internal::Factory_DoStuff2_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  mojo::ScopedDataPipeConsumerHandle TakePipe() {
    mojo::ScopedDataPipeConsumerHandle result;
    bool ret =
        mojo::internal::Deserialize<mojo::ScopedDataPipeConsumerHandle>(
            &data_->pipe, &result, message_);
    DCHECK(ret);
    return result;
  }
 private:
  internal::Factory_DoStuff2_Params_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class Factory_DoStuff2_ResponseParamsDataView {
 public:
  Factory_DoStuff2_ResponseParamsDataView() {}

  Factory_DoStuff2_ResponseParamsDataView(
      internal::Factory_DoStuff2_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetTextDataView(
      mojo::StringDataView* output);

  template <typename UserType>
  WARN_UNUSED_RESULT bool ReadText(UserType* output) {
    
    auto* pointer = data_->text.Get();
    return mojo::internal::Deserialize<mojo::StringDataView>(
        pointer, output, message_);
  }
 private:
  internal::Factory_DoStuff2_ResponseParams_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class Factory_CreateNamedObject_ParamsDataView {
 public:
  Factory_CreateNamedObject_ParamsDataView() {}

  Factory_CreateNamedObject_ParamsDataView(
      internal::Factory_CreateNamedObject_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  template <typename UserType>
  UserType TakeObj() {
    UserType result;
    bool ret =
        mojo::internal::Deserialize<mojo::InterfaceRequestDataView<::sample::NamedObjectInterfaceBase>>(
            &data_->obj, &result, message_);
    DCHECK(ret);
    return result;
  }
 private:
  internal::Factory_CreateNamedObject_Params_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class Factory_RequestImportedInterface_ParamsDataView {
 public:
  Factory_RequestImportedInterface_ParamsDataView() {}

  Factory_RequestImportedInterface_ParamsDataView(
      internal::Factory_RequestImportedInterface_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  template <typename UserType>
  UserType TakeObj() {
    UserType result;
    bool ret =
        mojo::internal::Deserialize<mojo::InterfaceRequestDataView<::imported::ImportedInterfaceInterfaceBase>>(
            &data_->obj, &result, message_);
    DCHECK(ret);
    return result;
  }
 private:
  internal::Factory_RequestImportedInterface_Params_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class Factory_RequestImportedInterface_ResponseParamsDataView {
 public:
  Factory_RequestImportedInterface_ResponseParamsDataView() {}

  Factory_RequestImportedInterface_ResponseParamsDataView(
      internal::Factory_RequestImportedInterface_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  template <typename UserType>
  UserType TakeObj() {
    UserType result;
    bool ret =
        mojo::internal::Deserialize<mojo::InterfaceRequestDataView<::imported::ImportedInterfaceInterfaceBase>>(
            &data_->obj, &result, message_);
    DCHECK(ret);
    return result;
  }
 private:
  internal::Factory_RequestImportedInterface_ResponseParams_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class Factory_TakeImportedInterface_ParamsDataView {
 public:
  Factory_TakeImportedInterface_ParamsDataView() {}

  Factory_TakeImportedInterface_ParamsDataView(
      internal::Factory_TakeImportedInterface_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  template <typename UserType>
  UserType TakeObj() {
    UserType result;
    bool ret =
        mojo::internal::Deserialize<mojo::InterfacePtrDataView<::imported::ImportedInterfaceInterfaceBase>>(
            &data_->obj, &result, message_);
    DCHECK(ret);
    return result;
  }
 private:
  internal::Factory_TakeImportedInterface_Params_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};



class Factory_TakeImportedInterface_ResponseParamsDataView {
 public:
  Factory_TakeImportedInterface_ResponseParamsDataView() {}

  Factory_TakeImportedInterface_ResponseParamsDataView(
      internal::Factory_TakeImportedInterface_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  template <typename UserType>
  UserType TakeObj() {
    UserType result;
    bool ret =
        mojo::internal::Deserialize<mojo::InterfacePtrDataView<::imported::ImportedInterfaceInterfaceBase>>(
            &data_->obj, &result, message_);
    DCHECK(ret);
    return result;
  }
 private:
  internal::Factory_TakeImportedInterface_ResponseParams_Data* data_ = nullptr;
  mojo::Message* message_ = nullptr;
};


inline void NamedObject_SetName_ParamsDataView::GetNameDataView(
    mojo::StringDataView* output) {
  auto pointer = data_->name.Get();
  *output = mojo::StringDataView(pointer, message_);
}




inline void NamedObject_GetName_ResponseParamsDataView::GetNameDataView(
    mojo::StringDataView* output) {
  auto pointer = data_->name.Get();
  *output = mojo::StringDataView(pointer, message_);
}


inline void Factory_DoStuff_ParamsDataView::GetRequestDataView(
    RequestDataView* output) {
  auto pointer = data_->request.Get();
  *output = RequestDataView(pointer, message_);
}


inline void Factory_DoStuff_ResponseParamsDataView::GetResponseDataView(
    ResponseDataView* output) {
  auto pointer = data_->response.Get();
  *output = ResponseDataView(pointer, message_);
}
inline void Factory_DoStuff_ResponseParamsDataView::GetTextDataView(
    mojo::StringDataView* output) {
  auto pointer = data_->text.Get();
  *output = mojo::StringDataView(pointer, message_);
}




inline void Factory_DoStuff2_ResponseParamsDataView::GetTextDataView(
    mojo::StringDataView* output) {
  auto pointer = data_->text.Get();
  *output = mojo::StringDataView(pointer, message_);
}











}  // namespace sample

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif  // MOJO_PUBLIC_INTERFACES_BINDINGS_TESTS_SAMPLE_FACTORY_MOJOM_PARAMS_DATA_H_