// mojo/public/interfaces/bindings/tests/struct_with_traits.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef MOJO_PUBLIC_INTERFACES_BINDINGS_TESTS_STRUCT_WITH_TRAITS_MOJOM_PARAMS_DATA_H_
#define MOJO_PUBLIC_INTERFACES_BINDINGS_TESTS_STRUCT_WITH_TRAITS_MOJOM_PARAMS_DATA_H_

#include "base/macros.h"
#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"
#include "mojo/public/cpp/bindings/lib/validation_context.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace mojo {
namespace test {
namespace internal {
class  TraitsTestService_EchoStructWithTraits_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StructWithTraits_Data> s;

 private:
  friend class mojo::internal::MessageFragment<TraitsTestService_EchoStructWithTraits_Params_Data>;

  TraitsTestService_EchoStructWithTraits_Params_Data();
  ~TraitsTestService_EchoStructWithTraits_Params_Data() = delete;
};
static_assert(sizeof(TraitsTestService_EchoStructWithTraits_Params_Data) == 16,
              "Bad sizeof(TraitsTestService_EchoStructWithTraits_Params_Data)");
class  TraitsTestService_EchoStructWithTraits_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StructWithTraits_Data> passed;

 private:
  friend class mojo::internal::MessageFragment<TraitsTestService_EchoStructWithTraits_ResponseParams_Data>;

  TraitsTestService_EchoStructWithTraits_ResponseParams_Data();
  ~TraitsTestService_EchoStructWithTraits_ResponseParams_Data() = delete;
};
static_assert(sizeof(TraitsTestService_EchoStructWithTraits_ResponseParams_Data) == 16,
              "Bad sizeof(TraitsTestService_EchoStructWithTraits_ResponseParams_Data)");
class  TraitsTestService_EchoTrivialStructWithTraits_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::TrivialStructWithTraits_Data> s;

 private:
  friend class mojo::internal::MessageFragment<TraitsTestService_EchoTrivialStructWithTraits_Params_Data>;

  TraitsTestService_EchoTrivialStructWithTraits_Params_Data();
  ~TraitsTestService_EchoTrivialStructWithTraits_Params_Data() = delete;
};
static_assert(sizeof(TraitsTestService_EchoTrivialStructWithTraits_Params_Data) == 16,
              "Bad sizeof(TraitsTestService_EchoTrivialStructWithTraits_Params_Data)");
class  TraitsTestService_EchoTrivialStructWithTraits_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::TrivialStructWithTraits_Data> passed;

 private:
  friend class mojo::internal::MessageFragment<TraitsTestService_EchoTrivialStructWithTraits_ResponseParams_Data>;

  TraitsTestService_EchoTrivialStructWithTraits_ResponseParams_Data();
  ~TraitsTestService_EchoTrivialStructWithTraits_ResponseParams_Data() = delete;
};
static_assert(sizeof(TraitsTestService_EchoTrivialStructWithTraits_ResponseParams_Data) == 16,
              "Bad sizeof(TraitsTestService_EchoTrivialStructWithTraits_ResponseParams_Data)");
class  TraitsTestService_EchoMoveOnlyStructWithTraits_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::MoveOnlyStructWithTraits_Data> s;

 private:
  friend class mojo::internal::MessageFragment<TraitsTestService_EchoMoveOnlyStructWithTraits_Params_Data>;

  TraitsTestService_EchoMoveOnlyStructWithTraits_Params_Data();
  ~TraitsTestService_EchoMoveOnlyStructWithTraits_Params_Data() = delete;
};
static_assert(sizeof(TraitsTestService_EchoMoveOnlyStructWithTraits_Params_Data) == 16,
              "Bad sizeof(TraitsTestService_EchoMoveOnlyStructWithTraits_Params_Data)");
class  TraitsTestService_EchoMoveOnlyStructWithTraits_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::MoveOnlyStructWithTraits_Data> passed;

 private:
  friend class mojo::internal::MessageFragment<TraitsTestService_EchoMoveOnlyStructWithTraits_ResponseParams_Data>;

  TraitsTestService_EchoMoveOnlyStructWithTraits_ResponseParams_Data();
  ~TraitsTestService_EchoMoveOnlyStructWithTraits_ResponseParams_Data() = delete;
};
static_assert(sizeof(TraitsTestService_EchoMoveOnlyStructWithTraits_ResponseParams_Data) == 16,
              "Bad sizeof(TraitsTestService_EchoMoveOnlyStructWithTraits_ResponseParams_Data)");
class  TraitsTestService_EchoNullableMoveOnlyStructWithTraits_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::MoveOnlyStructWithTraits_Data> s;

 private:
  friend class mojo::internal::MessageFragment<TraitsTestService_EchoNullableMoveOnlyStructWithTraits_Params_Data>;

  TraitsTestService_EchoNullableMoveOnlyStructWithTraits_Params_Data();
  ~TraitsTestService_EchoNullableMoveOnlyStructWithTraits_Params_Data() = delete;
};
static_assert(sizeof(TraitsTestService_EchoNullableMoveOnlyStructWithTraits_Params_Data) == 16,
              "Bad sizeof(TraitsTestService_EchoNullableMoveOnlyStructWithTraits_Params_Data)");
class  TraitsTestService_EchoNullableMoveOnlyStructWithTraits_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::MoveOnlyStructWithTraits_Data> passed;

 private:
  friend class mojo::internal::MessageFragment<TraitsTestService_EchoNullableMoveOnlyStructWithTraits_ResponseParams_Data>;

  TraitsTestService_EchoNullableMoveOnlyStructWithTraits_ResponseParams_Data();
  ~TraitsTestService_EchoNullableMoveOnlyStructWithTraits_ResponseParams_Data() = delete;
};
static_assert(sizeof(TraitsTestService_EchoNullableMoveOnlyStructWithTraits_ResponseParams_Data) == 16,
              "Bad sizeof(TraitsTestService_EchoNullableMoveOnlyStructWithTraits_ResponseParams_Data)");
class  TraitsTestService_EchoEnumWithTraits_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t e;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<TraitsTestService_EchoEnumWithTraits_Params_Data>;

  TraitsTestService_EchoEnumWithTraits_Params_Data();
  ~TraitsTestService_EchoEnumWithTraits_Params_Data() = delete;
};
static_assert(sizeof(TraitsTestService_EchoEnumWithTraits_Params_Data) == 16,
              "Bad sizeof(TraitsTestService_EchoEnumWithTraits_Params_Data)");
class  TraitsTestService_EchoEnumWithTraits_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t passed;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<TraitsTestService_EchoEnumWithTraits_ResponseParams_Data>;

  TraitsTestService_EchoEnumWithTraits_ResponseParams_Data();
  ~TraitsTestService_EchoEnumWithTraits_ResponseParams_Data() = delete;
};
static_assert(sizeof(TraitsTestService_EchoEnumWithTraits_ResponseParams_Data) == 16,
              "Bad sizeof(TraitsTestService_EchoEnumWithTraits_ResponseParams_Data)");
class  TraitsTestService_EchoStructWithTraitsForUniquePtr_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StructWithTraitsForUniquePtr_Data> e;

 private:
  friend class mojo::internal::MessageFragment<TraitsTestService_EchoStructWithTraitsForUniquePtr_Params_Data>;

  TraitsTestService_EchoStructWithTraitsForUniquePtr_Params_Data();
  ~TraitsTestService_EchoStructWithTraitsForUniquePtr_Params_Data() = delete;
};
static_assert(sizeof(TraitsTestService_EchoStructWithTraitsForUniquePtr_Params_Data) == 16,
              "Bad sizeof(TraitsTestService_EchoStructWithTraitsForUniquePtr_Params_Data)");
class  TraitsTestService_EchoStructWithTraitsForUniquePtr_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StructWithTraitsForUniquePtr_Data> passed;

 private:
  friend class mojo::internal::MessageFragment<TraitsTestService_EchoStructWithTraitsForUniquePtr_ResponseParams_Data>;

  TraitsTestService_EchoStructWithTraitsForUniquePtr_ResponseParams_Data();
  ~TraitsTestService_EchoStructWithTraitsForUniquePtr_ResponseParams_Data() = delete;
};
static_assert(sizeof(TraitsTestService_EchoStructWithTraitsForUniquePtr_ResponseParams_Data) == 16,
              "Bad sizeof(TraitsTestService_EchoStructWithTraitsForUniquePtr_ResponseParams_Data)");
class  TraitsTestService_EchoNullableStructWithTraitsForUniquePtr_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StructWithTraitsForUniquePtr_Data> e;

 private:
  friend class mojo::internal::MessageFragment<TraitsTestService_EchoNullableStructWithTraitsForUniquePtr_Params_Data>;

  TraitsTestService_EchoNullableStructWithTraitsForUniquePtr_Params_Data();
  ~TraitsTestService_EchoNullableStructWithTraitsForUniquePtr_Params_Data() = delete;
};
static_assert(sizeof(TraitsTestService_EchoNullableStructWithTraitsForUniquePtr_Params_Data) == 16,
              "Bad sizeof(TraitsTestService_EchoNullableStructWithTraitsForUniquePtr_Params_Data)");
class  TraitsTestService_EchoNullableStructWithTraitsForUniquePtr_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StructWithTraitsForUniquePtr_Data> passed;

 private:
  friend class mojo::internal::MessageFragment<TraitsTestService_EchoNullableStructWithTraitsForUniquePtr_ResponseParams_Data>;

  TraitsTestService_EchoNullableStructWithTraitsForUniquePtr_ResponseParams_Data();
  ~TraitsTestService_EchoNullableStructWithTraitsForUniquePtr_ResponseParams_Data() = delete;
};
static_assert(sizeof(TraitsTestService_EchoNullableStructWithTraitsForUniquePtr_ResponseParams_Data) == 16,
              "Bad sizeof(TraitsTestService_EchoNullableStructWithTraitsForUniquePtr_ResponseParams_Data)");
class  TraitsTestService_EchoUnionWithTraits_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  internal::UnionWithTraits_Data u;

 private:
  friend class mojo::internal::MessageFragment<TraitsTestService_EchoUnionWithTraits_Params_Data>;

  TraitsTestService_EchoUnionWithTraits_Params_Data();
  ~TraitsTestService_EchoUnionWithTraits_Params_Data() = delete;
};
static_assert(sizeof(TraitsTestService_EchoUnionWithTraits_Params_Data) == 24,
              "Bad sizeof(TraitsTestService_EchoUnionWithTraits_Params_Data)");
class  TraitsTestService_EchoUnionWithTraits_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  internal::UnionWithTraits_Data passed;

 private:
  friend class mojo::internal::MessageFragment<TraitsTestService_EchoUnionWithTraits_ResponseParams_Data>;

  TraitsTestService_EchoUnionWithTraits_ResponseParams_Data();
  ~TraitsTestService_EchoUnionWithTraits_ResponseParams_Data() = delete;
};
static_assert(sizeof(TraitsTestService_EchoUnionWithTraits_ResponseParams_Data) == 24,
              "Bad sizeof(TraitsTestService_EchoUnionWithTraits_ResponseParams_Data)");
class  TestUnserializedStruct_PassUnserializedStruct_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StructWithUnreachableTraits_Data> s;

 private:
  friend class mojo::internal::MessageFragment<TestUnserializedStruct_PassUnserializedStruct_Params_Data>;

  TestUnserializedStruct_PassUnserializedStruct_Params_Data();
  ~TestUnserializedStruct_PassUnserializedStruct_Params_Data() = delete;
};
static_assert(sizeof(TestUnserializedStruct_PassUnserializedStruct_Params_Data) == 16,
              "Bad sizeof(TestUnserializedStruct_PassUnserializedStruct_Params_Data)");
class  TestUnserializedStruct_PassUnserializedStruct_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StructWithUnreachableTraits_Data> passed;

 private:
  friend class mojo::internal::MessageFragment<TestUnserializedStruct_PassUnserializedStruct_ResponseParams_Data>;

  TestUnserializedStruct_PassUnserializedStruct_ResponseParams_Data();
  ~TestUnserializedStruct_PassUnserializedStruct_ResponseParams_Data() = delete;
};
static_assert(sizeof(TestUnserializedStruct_PassUnserializedStruct_ResponseParams_Data) == 16,
              "Bad sizeof(TestUnserializedStruct_PassUnserializedStruct_ResponseParams_Data)");
class  ForceSerializeTester_SendForceSerializedStruct_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StructForceSerialize_Data> s;

 private:
  friend class mojo::internal::MessageFragment<ForceSerializeTester_SendForceSerializedStruct_Params_Data>;

  ForceSerializeTester_SendForceSerializedStruct_Params_Data();
  ~ForceSerializeTester_SendForceSerializedStruct_Params_Data() = delete;
};
static_assert(sizeof(ForceSerializeTester_SendForceSerializedStruct_Params_Data) == 16,
              "Bad sizeof(ForceSerializeTester_SendForceSerializedStruct_Params_Data)");
class  ForceSerializeTester_SendForceSerializedStruct_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StructForceSerialize_Data> passed;

 private:
  friend class mojo::internal::MessageFragment<ForceSerializeTester_SendForceSerializedStruct_ResponseParams_Data>;

  ForceSerializeTester_SendForceSerializedStruct_ResponseParams_Data();
  ~ForceSerializeTester_SendForceSerializedStruct_ResponseParams_Data() = delete;
};
static_assert(sizeof(ForceSerializeTester_SendForceSerializedStruct_ResponseParams_Data) == 16,
              "Bad sizeof(ForceSerializeTester_SendForceSerializedStruct_ResponseParams_Data)");
class  ForceSerializeTester_SendNestedForceSerializedStruct_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StructNestedForceSerialize_Data> s;

 private:
  friend class mojo::internal::MessageFragment<ForceSerializeTester_SendNestedForceSerializedStruct_Params_Data>;

  ForceSerializeTester_SendNestedForceSerializedStruct_Params_Data();
  ~ForceSerializeTester_SendNestedForceSerializedStruct_Params_Data() = delete;
};
static_assert(sizeof(ForceSerializeTester_SendNestedForceSerializedStruct_Params_Data) == 16,
              "Bad sizeof(ForceSerializeTester_SendNestedForceSerializedStruct_Params_Data)");
class  ForceSerializeTester_SendNestedForceSerializedStruct_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StructNestedForceSerialize_Data> passed;

 private:
  friend class mojo::internal::MessageFragment<ForceSerializeTester_SendNestedForceSerializedStruct_ResponseParams_Data>;

  ForceSerializeTester_SendNestedForceSerializedStruct_ResponseParams_Data();
  ~ForceSerializeTester_SendNestedForceSerializedStruct_ResponseParams_Data() = delete;
};
static_assert(sizeof(ForceSerializeTester_SendNestedForceSerializedStruct_ResponseParams_Data) == 16,
              "Bad sizeof(ForceSerializeTester_SendNestedForceSerializedStruct_ResponseParams_Data)");

}  // namespace internal


class TraitsTestService_EchoStructWithTraits_ParamsDataView {
 public:
  TraitsTestService_EchoStructWithTraits_ParamsDataView() {}

  TraitsTestService_EchoStructWithTraits_ParamsDataView(
      internal::TraitsTestService_EchoStructWithTraits_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetSDataView(
      StructWithTraitsDataView* output);

  template <typename UserType>
  WARN_UNUSED_RESULT bool ReadS(UserType* output) {
    
    auto* pointer = data_->s.Get();
    return mojo::internal::Deserialize<::mojo::test::StructWithTraitsDataView>(
        pointer, output, message_);
  }
 private:
