// mojo/public/interfaces/bindings/tests/test_native_types.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef MOJO_PUBLIC_INTERFACES_BINDINGS_TESTS_TEST_NATIVE_TYPES_MOJOM_PARAMS_DATA_H_
#define MOJO_PUBLIC_INTERFACES_BINDINGS_TESTS_TEST_NATIVE_TYPES_MOJOM_PARAMS_DATA_H_

#include "base/macros.h"
#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"
#include "mojo/public/cpp/bindings/lib/validation_context.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace mojo {
namespace test {
namespace internal {
class  PicklePasser_PassPickledStruct_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::PickledStruct_Data> pickle;

 private:
  friend class mojo::internal::MessageFragment<PicklePasser_PassPickledStruct_Params_Data>;

  PicklePasser_PassPickledStruct_Params_Data();
  ~PicklePasser_PassPickledStruct_Params_Data() = delete;
};
static_assert(sizeof(PicklePasser_PassPickledStruct_Params_Data) == 16,
              "Bad sizeof(PicklePasser_PassPickledStruct_Params_Data)");
class  PicklePasser_PassPickledStruct_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::PickledStruct_Data> passed;

 private:
  friend class mojo::internal::MessageFragment<PicklePasser_PassPickledStruct_ResponseParams_Data>;

  PicklePasser_PassPickledStruct_ResponseParams_Data();
  ~PicklePasser_PassPickledStruct_ResponseParams_Data() = delete;
};
static_assert(sizeof(PicklePasser_PassPickledStruct_ResponseParams_Data) == 16,
              "Bad sizeof(PicklePasser_PassPickledStruct_ResponseParams_Data)");
class  PicklePasser_PassPickledEnum_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t pickle;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<PicklePasser_PassPickledEnum_Params_Data>;

  PicklePasser_PassPickledEnum_Params_Data();
  ~PicklePasser_PassPickledEnum_Params_Data() = delete;
};
static_assert(sizeof(PicklePasser_PassPickledEnum_Params_Data) == 16,
              "Bad sizeof(PicklePasser_PassPickledEnum_Params_Data)");
class  PicklePasser_PassPickledEnum_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t passed;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<PicklePasser_PassPickledEnum_ResponseParams_Data>;

  PicklePasser_PassPickledEnum_ResponseParams_Data();
  ~PicklePasser_PassPickledEnum_ResponseParams_Data() = delete;
};
static_assert(sizeof(PicklePasser_PassPickledEnum_ResponseParams_Data) == 16,
              "Bad sizeof(PicklePasser_PassPickledEnum_ResponseParams_Data)");
class  PicklePasser_PassPickleContainer_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::PickleContainer_Data> container;

 private:
  friend class mojo::internal::MessageFragment<PicklePasser_PassPickleContainer_Params_Data>;

  PicklePasser_PassPickleContainer_Params_Data();
  ~PicklePasser_PassPickleContainer_Params_Data() = delete;
};
static_assert(sizeof(PicklePasser_PassPickleContainer_Params_Data) == 16,
              "Bad sizeof(PicklePasser_PassPickleContainer_Params_Data)");
class  PicklePasser_PassPickleContainer_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::PickleContainer_Data> passed;

 private:
  friend class mojo::internal::MessageFragment<PicklePasser_PassPickleContainer_ResponseParams_Data>;

  PicklePasser_PassPickleContainer_ResponseParams_Data();
  ~PicklePasser_PassPickleContainer_ResponseParams_Data() = delete;
};
static_assert(sizeof(PicklePasser_PassPickleContainer_ResponseParams_Data) == 16,
              "Bad sizeof(PicklePasser_PassPickleContainer_ResponseParams_Data)");
class  PicklePasser_PassPickles_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::PickledStruct_Data>>> pickles;

 private:
  friend class mojo::internal::MessageFragment<PicklePasser_PassPickles_Params_Data>;

  PicklePasser_PassPickles_Params_Data();
  ~PicklePasser_PassPickles_Params_Data() = delete;
};
static_assert(sizeof(PicklePasser_PassPickles_Params_Data) == 16,
              "Bad sizeof(PicklePasser_PassPickles_Params_Data)");
class  PicklePasser_PassPickles_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::PickledStruct_Data>>> passed;

 private:
  friend class mojo::internal::MessageFragment<PicklePasser_PassPickles_ResponseParams_Data>;

  PicklePasser_PassPickles_ResponseParams_Data();
  ~PicklePasser_PassPickles_ResponseParams_Data() = delete;
};
static_assert(sizeof(PicklePasser_PassPickles_ResponseParams_Data) == 16,
              "Bad sizeof(PicklePasser_PassPickles_ResponseParams_Data)");
class  PicklePasser_PassPickleArrays_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::PickledStruct_Data>>>>> pickle_arrays;

 private:
  friend class mojo::internal::MessageFragment<PicklePasser_PassPickleArrays_Params_Data>;

  PicklePasser_PassPickleArrays_Params_Data();
  ~PicklePasser_PassPickleArrays_Params_Data() = delete;
};
static_assert(sizeof(PicklePasser_PassPickleArrays_Params_Data) == 16,
              "Bad sizeof(PicklePasser_PassPickleArrays_Params_Data)");
class  PicklePasser_PassPickleArrays_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::PickledStruct_Data>>>>> passed;

 private:
  friend class mojo::internal::MessageFragment<PicklePasser_PassPickleArrays_ResponseParams_Data>;

  PicklePasser_PassPickleArrays_ResponseParams_Data();
  ~PicklePasser_PassPickleArrays_ResponseParams_Data() = delete;
};
static_assert(sizeof(PicklePasser_PassPickleArrays_ResponseParams_Data) == 16,
              "Bad sizeof(PicklePasser_PassPickleArrays_ResponseParams_Data)");
class  RectService_AddRect_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo::test::internal::TypemappedRect_Data> r;

 private:
  friend class mojo::internal::MessageFragment<RectService_AddRect_Params_Data>;

  RectService_AddRect_Params_Data();
  ~RectService_AddRect_Params_Data() = delete;
};
static_assert(sizeof(RectService_AddRect_Params_Data) == 16,
              "Bad sizeof(RectService_AddRect_Params_Data)");
class  RectService_GetLargestRect_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<RectService_GetLargestRect_Params_Data>;

  RectService_GetLargestRect_Params_Data();
  ~RectService_GetLargestRect_Params_Data() = delete;
};
static_assert(sizeof(RectService_GetLargestRect_Params_Data) == 8,
              "Bad sizeof(RectService_GetLargestRect_Params_Data)");
class  RectService_GetLargestRect_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo::test::internal::TypemappedRect_Data> largest;

 private:
  friend class mojo::internal::MessageFragment<RectService_GetLargestRect_ResponseParams_Data>;

  RectService_GetLargestRect_ResponseParams_Data();
  ~RectService_GetLargestRect_ResponseParams_Data() = delete;
};
static_assert(sizeof(RectService_GetLargestRect_ResponseParams_Data) == 16,
              "Bad sizeof(RectService_GetLargestRect_ResponseParams_Data)");
class  RectService_PassSharedRect_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo::test::internal::SharedTypemappedRect_Data> r;

 private:
  friend class mojo::internal::MessageFragment<RectService_PassSharedRect_Params_Data>;

  RectService_PassSharedRect_Params_Data();
  ~RectService_PassSharedRect_Params_Data() = delete;
};
static_assert(sizeof(RectService_PassSharedRect_Params_Data) == 16,
              "Bad sizeof(RectService_PassSharedRect_Params_Data)");
class  RectService_PassSharedRect_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo::test::internal::SharedTypemappedRect_Data> passed;

 private:
  friend class mojo::internal::MessageFragment<RectService_PassSharedRect_ResponseParams_Data>;

  RectService_PassSharedRect_ResponseParams_Data();
  ~RectService_PassSharedRect_ResponseParams_Data() = delete;
};
static_assert(sizeof(RectService_PassSharedRect_ResponseParams_Data) == 16,
              "Bad sizeof(RectService_PassSharedRect_ResponseParams_Data)");
class  NativeTypeTester_PassNativeStruct_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::TestNativeStructMojom_Data> s;

 private:
  friend class mojo::internal::MessageFragment<NativeTypeTester_PassNativeStruct_Params_Data>;

  NativeTypeTester_PassNativeStruct_Params_Data();
  ~NativeTypeTester_PassNativeStruct_Params_Data() = delete;
};
static_assert(sizeof(NativeTypeTester_PassNativeStruct_Params_Data) == 16,
              "Bad sizeof(NativeTypeTester_PassNativeStruct_Params_Data)");
class  NativeTypeTester_PassNativeStruct_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::TestNativeStructMojom_Data> passed;

 private:
  friend class mojo::internal::MessageFragment<NativeTypeTester_PassNativeStruct_ResponseParams_Data>;

  NativeTypeTester_PassNativeStruct_ResponseParams_Data();
  ~NativeTypeTester_PassNativeStruct_ResponseParams_Data() = delete;
};
static_assert(sizeof(NativeTypeTester_PassNativeStruct_ResponseParams_Data) == 16,
              "Bad sizeof(NativeTypeTester_PassNativeStruct_ResponseParams_Data)");
class  NativeTypeTester_PassNativeStructWithAttachments_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::TestNativeStructWithAttachmentsMojom_Data> s;

 private:
  friend class mojo::internal::MessageFragment<NativeTypeTester_PassNativeStructWithAttachments_Params_Data>;

  NativeTypeTester_PassNativeStructWithAttachments_Params_Data();
  ~NativeTypeTester_PassNativeStructWithAttachments_Params_Data() = delete;
};
static_assert(sizeof(NativeTypeTester_PassNativeStructWithAttachments_Params_Data) == 16,
              "Bad sizeof(NativeTypeTester_PassNativeStructWithAttachments_Params_Data)");
class  NativeTypeTester_PassNativeStructWithAttachments_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::TestNativeStructWithAttachmentsMojom_Data> s;

 private:
  friend class mojo::internal::MessageFragment<NativeTypeTester_PassNativeStructWithAttachments_ResponseParams_Data>;

  NativeTypeTester_PassNativeStructWithAttachments_ResponseParams_Data();
  ~NativeTypeTester_PassNativeStructWithAttachments_ResponseParams_Data() = delete;
};
static_assert(sizeof(NativeTypeTester_PassNativeStructWithAttachments_ResponseParams_Data) == 16,
              "Bad sizeof(NativeTypeTester_PassNativeStructWithAttachments_ResponseParams_Data)");

}  // namespace internal


class PicklePasser_PassPickledStruct_ParamsDataView {
 public:
  PicklePasser_PassPickledStruct_ParamsDataView() {}

  PicklePasser_PassPickledStruct_ParamsDataView(
      internal::PicklePasser_PassPickledStruct_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  inline void GetPickleDataView(
      PickledStructDataView* output);

  template <typename UserType>
  WARN_UNUSED_RESULT bool ReadPickle(UserType* output) {
    
    auto* pointer = data_->pickle.Get();
    return mojo::internal::Deserialize<::mojo::test::PickledStructDataView>(
        pointer, output, message_);
  }
 private:
  internal::PicklePasser_PassPickledStruct_Params_Data* data_ = nullptr;
