// mojo/public/interfaces/bindings/tests/test_associated_interfaces.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef MOJO_PUBLIC_INTERFACES_BINDINGS_TESTS_TEST_ASSOCIATED_INTERFACES_MOJOM_PARAMS_DATA_H_
#define MOJO_PUBLIC_INTERFACES_BINDINGS_TESTS_TEST_ASSOCIATED_INTERFACES_MOJOM_PARAMS_DATA_H_

#include "base/macros.h"
#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"
#include "mojo/public/cpp/bindings/lib/validation_context.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace mojo {
namespace test {
namespace internal {
class  InterfacePassesAssociated_PassFoo_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::AssociatedInterface_Data foo_remote;
  mojo::internal::AssociatedEndpointHandle_Data foo_receiver;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<InterfacePassesAssociated_PassFoo_Params_Data>;

  InterfacePassesAssociated_PassFoo_Params_Data();
  ~InterfacePassesAssociated_PassFoo_Params_Data() = delete;
};
static_assert(sizeof(InterfacePassesAssociated_PassFoo_Params_Data) == 24,
              "Bad sizeof(InterfacePassesAssociated_PassFoo_Params_Data)");
class  InterfacePassesAssociated_PassFoo_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::AssociatedInterface_Data foo_remote;
  mojo::internal::AssociatedEndpointHandle_Data foo_receiver;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<InterfacePassesAssociated_PassFoo_ResponseParams_Data>;

  InterfacePassesAssociated_PassFoo_ResponseParams_Data();
  ~InterfacePassesAssociated_PassFoo_ResponseParams_Data() = delete;
};
static_assert(sizeof(InterfacePassesAssociated_PassFoo_ResponseParams_Data) == 24,
              "Bad sizeof(InterfacePassesAssociated_PassFoo_ResponseParams_Data)");
class  InterfacePassesAssociated_PassStruct_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StructContainsAssociated_Data> foo_struct;

 private:
  friend class mojo::internal::MessageFragment<InterfacePassesAssociated_PassStruct_Params_Data>;

  InterfacePassesAssociated_PassStruct_Params_Data();
  ~InterfacePassesAssociated_PassStruct_Params_Data() = delete;
};
static_assert(sizeof(InterfacePassesAssociated_PassStruct_Params_Data) == 16,
              "Bad sizeof(InterfacePassesAssociated_PassStruct_Params_Data)");
class  InterfacePassesAssociated_PassStruct_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StructContainsAssociated_Data> foo_struct;

 private:
  friend class mojo::internal::MessageFragment<InterfacePassesAssociated_PassStruct_ResponseParams_Data>;

  InterfacePassesAssociated_PassStruct_ResponseParams_Data();
  ~InterfacePassesAssociated_PassStruct_ResponseParams_Data() = delete;
};
static_assert(sizeof(InterfacePassesAssociated_PassStruct_ResponseParams_Data) == 16,
              "Bad sizeof(InterfacePassesAssociated_PassStruct_ResponseParams_Data)");
class  InterfacePassesAssociated_PassUnion_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  internal::UnionContainsAssociated_Data foo_union;

 private:
  friend class mojo::internal::MessageFragment<InterfacePassesAssociated_PassUnion_Params_Data>;

  InterfacePassesAssociated_PassUnion_Params_Data();
  ~InterfacePassesAssociated_PassUnion_Params_Data() = delete;
};
static_assert(sizeof(InterfacePassesAssociated_PassUnion_Params_Data) == 24,
              "Bad sizeof(InterfacePassesAssociated_PassUnion_Params_Data)");
class  InterfacePassesAssociated_PassUnion_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  internal::UnionContainsAssociated_Data foo_union;

 private:
  friend class mojo::internal::MessageFragment<InterfacePassesAssociated_PassUnion_ResponseParams_Data>;

  InterfacePassesAssociated_PassUnion_ResponseParams_Data();
  ~InterfacePassesAssociated_PassUnion_ResponseParams_Data() = delete;
};
static_assert(sizeof(InterfacePassesAssociated_PassUnion_ResponseParams_Data) == 24,
              "Bad sizeof(InterfacePassesAssociated_PassUnion_ResponseParams_Data)");
class  IntegerSender_Echo_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t value;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<IntegerSender_Echo_Params_Data>;

  IntegerSender_Echo_Params_Data();
  ~IntegerSender_Echo_Params_Data() = delete;
};
static_assert(sizeof(IntegerSender_Echo_Params_Data) == 16,
              "Bad sizeof(IntegerSender_Echo_Params_Data)");
class  IntegerSender_Echo_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t value;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<IntegerSender_Echo_ResponseParams_Data>;

  IntegerSender_Echo_ResponseParams_Data();
  ~IntegerSender_Echo_ResponseParams_Data() = delete;
};
static_assert(sizeof(IntegerSender_Echo_ResponseParams_Data) == 16,
              "Bad sizeof(IntegerSender_Echo_ResponseParams_Data)");
class  IntegerSender_Send_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t value;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<IntegerSender_Send_Params_Data>;

  IntegerSender_Send_Params_Data();
  ~IntegerSender_Send_Params_Data() = delete;
};
static_assert(sizeof(IntegerSender_Send_Params_Data) == 16,
              "Bad sizeof(IntegerSender_Send_Params_Data)");
class  StringSender_Echo_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> value;

 private:
  friend class mojo::internal::MessageFragment<StringSender_Echo_Params_Data>;

  StringSender_Echo_Params_Data();
  ~StringSender_Echo_Params_Data() = delete;
};
static_assert(sizeof(StringSender_Echo_Params_Data) == 16,
              "Bad sizeof(StringSender_Echo_Params_Data)");
class  StringSender_Echo_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> value;

 private:
  friend class mojo::internal::MessageFragment<StringSender_Echo_ResponseParams_Data>;

  StringSender_Echo_ResponseParams_Data();
  ~StringSender_Echo_ResponseParams_Data() = delete;
};
static_assert(sizeof(StringSender_Echo_ResponseParams_Data) == 16,
              "Bad sizeof(StringSender_Echo_ResponseParams_Data)");
class  StringSender_Send_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> value;

 private:
  friend class mojo::internal::MessageFragment<StringSender_Send_Params_Data>;

  StringSender_Send_Params_Data();
  ~StringSender_Send_Params_Data() = delete;
};
static_assert(sizeof(StringSender_Send_Params_Data) == 16,
              "Bad sizeof(StringSender_Send_Params_Data)");
class  IntegerSenderConnection_GetSender_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::AssociatedEndpointHandle_Data receiver;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<IntegerSenderConnection_GetSender_Params_Data>;

  IntegerSenderConnection_GetSender_Params_Data();
  ~IntegerSenderConnection_GetSender_Params_Data() = delete;
};
static_assert(sizeof(IntegerSenderConnection_GetSender_Params_Data) == 16,
              "Bad sizeof(IntegerSenderConnection_GetSender_Params_Data)");
class  IntegerSenderConnection_AsyncGetSender_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  friend class mojo::internal::MessageFragment<IntegerSenderConnection_AsyncGetSender_Params_Data>;

  IntegerSenderConnection_AsyncGetSender_Params_Data();
  ~IntegerSenderConnection_AsyncGetSender_Params_Data() = delete;
};
static_assert(sizeof(IntegerSenderConnection_AsyncGetSender_Params_Data) == 8,
              "Bad sizeof(IntegerSenderConnection_AsyncGetSender_Params_Data)");
class  IntegerSenderConnection_AsyncGetSender_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::AssociatedInterface_Data sender;

 private:
  friend class mojo::internal::MessageFragment<IntegerSenderConnection_AsyncGetSender_ResponseParams_Data>;

  IntegerSenderConnection_AsyncGetSender_ResponseParams_Data();
  ~IntegerSenderConnection_AsyncGetSender_ResponseParams_Data() = delete;
};
static_assert(sizeof(IntegerSenderConnection_AsyncGetSender_ResponseParams_Data) == 16,
              "Bad sizeof(IntegerSenderConnection_AsyncGetSender_ResponseParams_Data)");
class  IntegerSenderConnectionAtBothEnds_GetSender_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::AssociatedEndpointHandle_Data receiver;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<IntegerSenderConnectionAtBothEnds_GetSender_Params_Data>;

  IntegerSenderConnectionAtBothEnds_GetSender_Params_Data();
  ~IntegerSenderConnectionAtBothEnds_GetSender_Params_Data() = delete;
};
static_assert(sizeof(IntegerSenderConnectionAtBothEnds_GetSender_Params_Data) == 16,
              "Bad sizeof(IntegerSenderConnectionAtBothEnds_GetSender_Params_Data)");
class  IntegerSenderConnectionAtBothEnds_SetSender_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::AssociatedInterface_Data sender;

 private:
  friend class mojo::internal::MessageFragment<IntegerSenderConnectionAtBothEnds_SetSender_Params_Data>;

  IntegerSenderConnectionAtBothEnds_SetSender_Params_Data();
  ~IntegerSenderConnectionAtBothEnds_SetSender_Params_Data() = delete;
};
static_assert(sizeof(IntegerSenderConnectionAtBothEnds_SetSender_Params_Data) == 16,
              "Bad sizeof(IntegerSenderConnectionAtBothEnds_SetSender_Params_Data)");
class  IntegerSenderConnectionAtBothEnds_SetSender_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t value;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<IntegerSenderConnectionAtBothEnds_SetSender_ResponseParams_Data>;

  IntegerSenderConnectionAtBothEnds_SetSender_ResponseParams_Data();
  ~IntegerSenderConnectionAtBothEnds_SetSender_ResponseParams_Data() = delete;
};
static_assert(sizeof(IntegerSenderConnectionAtBothEnds_SetSender_ResponseParams_Data) == 16,
              "Bad sizeof(IntegerSenderConnectionAtBothEnds_SetSender_ResponseParams_Data)");
class  SenderConnection_GetIntegerSender_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::AssociatedEndpointHandle_Data receiver;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<SenderConnection_GetIntegerSender_Params_Data>;

  SenderConnection_GetIntegerSender_Params_Data();
  ~SenderConnection_GetIntegerSender_Params_Data() = delete;
};
static_assert(sizeof(SenderConnection_GetIntegerSender_Params_Data) == 16,
              "Bad sizeof(SenderConnection_GetIntegerSender_Params_Data)");
class  SenderConnection_GetStringSender_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::AssociatedEndpointHandle_Data receiver;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<SenderConnection_GetStringSender_Params_Data>;

  SenderConnection_GetStringSender_Params_Data();
  ~SenderConnection_GetStringSender_Params_Data() = delete;
};
static_assert(sizeof(SenderConnection_GetStringSender_Params_Data) == 16,
              "Bad sizeof(SenderConnection_GetStringSender_Params_Data)");
class  AssociatedPingProvider_GetPing_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::AssociatedEndpointHandle_Data receiver;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<AssociatedPingProvider_GetPing_Params_Data>;

  AssociatedPingProvider_GetPing_Params_Data();
  ~AssociatedPingProvider_GetPing_Params_Data() = delete;
};
static_assert(sizeof(AssociatedPingProvider_GetPing_Params_Data) == 16,
              "Bad sizeof(AssociatedPingProvider_GetPing_Params_Data)");
class  AssociatedPingProviderProvider_GetPingProvider_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::AssociatedEndpointHandle_Data receiver;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<AssociatedPingProviderProvider_GetPingProvider_Params_Data>;

  AssociatedPingProviderProvider_GetPingProvider_Params_Data();
  ~AssociatedPingProviderProvider_GetPingProvider_Params_Data() = delete;
};
static_assert(sizeof(AssociatedPingProviderProvider_GetPingProvider_Params_Data) == 16,
              "Bad sizeof(AssociatedPingProviderProvider_GetPingProvider_Params_Data)");

}  // namespace internal


class InterfacePassesAssociated_PassFoo_ParamsDataView {
 public:
  InterfacePassesAssociated_PassFoo_ParamsDataView() {}

  InterfacePassesAssociated_PassFoo_ParamsDataView(
      internal::InterfacePassesAssociated_PassFoo_Params_Data* data,
      mojo::Message* message)
      : data_(data), message_(message) {}

  bool is_null() const { return !data_; }
  template <typename UserType>
  UserType TakeFooRemote() {
    UserType result;
    bool ret =
        mojo::internal::Deserialize<::mojo::test::FooInterfaceAssociatedPtrInfoDataView>(
            &data_->foo_remote, &result, message_);
    DCHECK(ret);
    return result;
  }
  template <typename UserType>
  UserType TakeFooReceiver() {
    UserType result;
    bool ret =
