// mojo/public/interfaces/bindings/tests/validation_test_interfaces.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef MOJO_PUBLIC_INTERFACES_BINDINGS_TESTS_VALIDATION_TEST_INTERFACES_MOJOM_PARAMS_DATA_H_
#define MOJO_PUBLIC_INTERFACES_BINDINGS_TESTS_VALIDATION_TEST_INTERFACES_MOJOM_PARAMS_DATA_H_

#include "base/macros.h"
#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"
#include "mojo/public/cpp/bindings/lib/validation_context.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace mojo {
namespace test {
namespace internal {
class  BoundsCheckTestInterface_Method0_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t param0;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<BoundsCheckTestInterface_Method0_Params_Data>;

  BoundsCheckTestInterface_Method0_Params_Data();
  ~BoundsCheckTestInterface_Method0_Params_Data() = delete;
};
static_assert(sizeof(BoundsCheckTestInterface_Method0_Params_Data) == 16,
              "Bad sizeof(BoundsCheckTestInterface_Method0_Params_Data)");
class  BoundsCheckTestInterface_Method0_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t param0;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<BoundsCheckTestInterface_Method0_ResponseParams_Data>;

  BoundsCheckTestInterface_Method0_ResponseParams_Data();
  ~BoundsCheckTestInterface_Method0_ResponseParams_Data() = delete;
};
static_assert(sizeof(BoundsCheckTestInterface_Method0_ResponseParams_Data) == 16,
              "Bad sizeof(BoundsCheckTestInterface_Method0_ResponseParams_Data)");
class  BoundsCheckTestInterface_Method1_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t param0;
  uint8_t padfinal_[7];

 private:
  friend class mojo::internal::MessageFragment<BoundsCheckTestInterface_Method1_Params_Data>;

  BoundsCheckTestInterface_Method1_Params_Data();
  ~BoundsCheckTestInterface_Method1_Params_Data() = delete;
};
static_assert(sizeof(BoundsCheckTestInterface_Method1_Params_Data) == 16,
              "Bad sizeof(BoundsCheckTestInterface_Method1_Params_Data)");
class  ConformanceTestInterface_Method0_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  float param0;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<ConformanceTestInterface_Method0_Params_Data>;

  ConformanceTestInterface_Method0_Params_Data();
  ~ConformanceTestInterface_Method0_Params_Data() = delete;
};
static_assert(sizeof(ConformanceTestInterface_Method0_Params_Data) == 16,
              "Bad sizeof(ConformanceTestInterface_Method0_Params_Data)");
class  ConformanceTestInterface_Method1_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StructA_Data> param0;

 private:
  friend class mojo::internal::MessageFragment<ConformanceTestInterface_Method1_Params_Data>;

  ConformanceTestInterface_Method1_Params_Data();
  ~ConformanceTestInterface_Method1_Params_Data() = delete;
};
static_assert(sizeof(ConformanceTestInterface_Method1_Params_Data) == 16,
              "Bad sizeof(ConformanceTestInterface_Method1_Params_Data)");
class  ConformanceTestInterface_Method2_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StructB_Data> param0;
  mojo::internal::Pointer<internal::StructA_Data> param1;

 private:
  friend class mojo::internal::MessageFragment<ConformanceTestInterface_Method2_Params_Data>;

  ConformanceTestInterface_Method2_Params_Data();
  ~ConformanceTestInterface_Method2_Params_Data() = delete;
};
static_assert(sizeof(ConformanceTestInterface_Method2_Params_Data) == 24,
              "Bad sizeof(ConformanceTestInterface_Method2_Params_Data)");
class  ConformanceTestInterface_Method3_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<bool>> param0;

 private:
  friend class mojo::internal::MessageFragment<ConformanceTestInterface_Method3_Params_Data>;

  ConformanceTestInterface_Method3_Params_Data();
  ~ConformanceTestInterface_Method3_Params_Data() = delete;
};
static_assert(sizeof(ConformanceTestInterface_Method3_Params_Data) == 16,
              "Bad sizeof(ConformanceTestInterface_Method3_Params_Data)");
class  ConformanceTestInterface_Method4_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StructC_Data> param0;
  mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> param1;

 private:
  friend class mojo::internal::MessageFragment<ConformanceTestInterface_Method4_Params_Data>;

  ConformanceTestInterface_Method4_Params_Data();
  ~ConformanceTestInterface_Method4_Params_Data() = delete;
};
static_assert(sizeof(ConformanceTestInterface_Method4_Params_Data) == 24,
              "Bad sizeof(ConformanceTestInterface_Method4_Params_Data)");
class  ConformanceTestInterface_Method5_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StructE_Data> param0;
  mojo::internal::Handle_Data param1;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<ConformanceTestInterface_Method5_Params_Data>;

  ConformanceTestInterface_Method5_Params_Data();
  ~ConformanceTestInterface_Method5_Params_Data() = delete;
};
static_assert(sizeof(ConformanceTestInterface_Method5_Params_Data) == 24,
              "Bad sizeof(ConformanceTestInterface_Method5_Params_Data)");
class  ConformanceTestInterface_Method6_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>>>> param0;

 private:
  friend class mojo::internal::MessageFragment<ConformanceTestInterface_Method6_Params_Data>;

  ConformanceTestInterface_Method6_Params_Data();
  ~ConformanceTestInterface_Method6_Params_Data() = delete;
};
static_assert(sizeof(ConformanceTestInterface_Method6_Params_Data) == 16,
              "Bad sizeof(ConformanceTestInterface_Method6_Params_Data)");
class  ConformanceTestInterface_Method7_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StructF_Data> param0;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>>>> param1;

 private:
  friend class mojo::internal::MessageFragment<ConformanceTestInterface_Method7_Params_Data>;

  ConformanceTestInterface_Method7_Params_Data();
  ~ConformanceTestInterface_Method7_Params_Data() = delete;
};
static_assert(sizeof(ConformanceTestInterface_Method7_Params_Data) == 24,
              "Bad sizeof(ConformanceTestInterface_Method7_Params_Data)");
class  ConformanceTestInterface_Method8_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>>>> param0;

 private:
  friend class mojo::internal::MessageFragment<ConformanceTestInterface_Method8_Params_Data>;

  ConformanceTestInterface_Method8_Params_Data();
  ~ConformanceTestInterface_Method8_Params_Data() = delete;
};
static_assert(sizeof(ConformanceTestInterface_Method8_Params_Data) == 16,
              "Bad sizeof(ConformanceTestInterface_Method8_Params_Data)");
class  ConformanceTestInterface_Method9_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Handle_Data>>>> param0;

 private:
  friend class mojo::internal::MessageFragment<ConformanceTestInterface_Method9_Params_Data>;

  ConformanceTestInterface_Method9_Params_Data();
  ~ConformanceTestInterface_Method9_Params_Data() = delete;
};
static_assert(sizeof(ConformanceTestInterface_Method9_Params_Data) == 16,
              "Bad sizeof(ConformanceTestInterface_Method9_Params_Data)");
class  ConformanceTestInterface_Method10_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Map_Data<mojo::internal::Pointer<mojo::internal::String_Data>, uint8_t>> param0;

 private:
  friend class mojo::internal::MessageFragment<ConformanceTestInterface_Method10_Params_Data>;

  ConformanceTestInterface_Method10_Params_Data();
  ~ConformanceTestInterface_Method10_Params_Data() = delete;
};
static_assert(sizeof(ConformanceTestInterface_Method10_Params_Data) == 16,
              "Bad sizeof(ConformanceTestInterface_Method10_Params_Data)");
class  ConformanceTestInterface_Method11_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StructG_Data> param0;

 private:
  friend class mojo::internal::MessageFragment<ConformanceTestInterface_Method11_Params_Data>;

  ConformanceTestInterface_Method11_Params_Data();
  ~ConformanceTestInterface_Method11_Params_Data() = delete;
};
static_assert(sizeof(ConformanceTestInterface_Method11_Params_Data) == 16,
              "Bad sizeof(ConformanceTestInterface_Method11_Params_Data)");
class  ConformanceTestInterface_Method12_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  float param0;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<ConformanceTestInterface_Method12_Params_Data>;

  ConformanceTestInterface_Method12_Params_Data();
  ~ConformanceTestInterface_Method12_Params_Data() = delete;
};
static_assert(sizeof(ConformanceTestInterface_Method12_Params_Data) == 16,
              "Bad sizeof(ConformanceTestInterface_Method12_Params_Data)");
class  ConformanceTestInterface_Method12_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  float param0;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<ConformanceTestInterface_Method12_ResponseParams_Data>;

  ConformanceTestInterface_Method12_ResponseParams_Data();
  ~ConformanceTestInterface_Method12_ResponseParams_Data() = delete;
};
static_assert(sizeof(ConformanceTestInterface_Method12_ResponseParams_Data) == 16,
              "Bad sizeof(ConformanceTestInterface_Method12_ResponseParams_Data)");
class  ConformanceTestInterface_Method13_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data param0;
  uint32_t param1;
  mojo::internal::Interface_Data param2;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<ConformanceTestInterface_Method13_Params_Data>;

  ConformanceTestInterface_Method13_Params_Data();
  ~ConformanceTestInterface_Method13_Params_Data() = delete;
};
static_assert(sizeof(ConformanceTestInterface_Method13_Params_Data) == 32,
              "Bad sizeof(ConformanceTestInterface_Method13_Params_Data)");
class  ConformanceTestInterface_Method14_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t param0;
  int32_t param1;

 private:
  friend class mojo::internal::MessageFragment<ConformanceTestInterface_Method14_Params_Data>;

  ConformanceTestInterface_Method14_Params_Data();
  ~ConformanceTestInterface_Method14_Params_Data() = delete;
};
static_assert(sizeof(ConformanceTestInterface_Method14_Params_Data) == 16,
              "Bad sizeof(ConformanceTestInterface_Method14_Params_Data)");
class  ConformanceTestInterface_Method15_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<int32_t>> param0;
  mojo::internal::Pointer<mojo::internal::Array_Data<int32_t>> param1;

 private:
  friend class mojo::internal::MessageFragment<ConformanceTestInterface_Method15_Params_Data>;

  ConformanceTestInterface_Method15_Params_Data();
  ~ConformanceTestInterface_Method15_Params_Data() = delete;
};
static_assert(sizeof(ConformanceTestInterface_Method15_Params_Data) == 24,
              "Bad sizeof(ConformanceTestInterface_Method15_Params_Data)");
class  ConformanceTestInterface_Method16_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Map_Data<int32_t, int32_t>> param0;

 private:
  friend class mojo::internal::MessageFragment<ConformanceTestInterface_Method16_Params_Data>;

  ConformanceTestInterface_Method16_Params_Data();
  ~ConformanceTestInterface_Method16_Params_Data() = delete;
};
static_assert(sizeof(ConformanceTestInterface_Method16_Params_Data) == 16,
              "Bad sizeof(ConformanceTestInterface_Method16_Params_Data)");
class  ConformanceTestInterface_Method17_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Interface_Data>> param0;

 private:
  friend class mojo::internal::MessageFragment<ConformanceTestInterface_Method17_Params_Data>;

  ConformanceTestInterface_Method17_Params_Data();
  ~ConformanceTestInterface_Method17_Params_Data() = delete;
};
static_assert(sizeof(ConformanceTestInterface_Method17_Params_Data) == 16,
              "Bad sizeof(ConformanceTestInterface_Method17_Params_Data)");
class  ConformanceTestInterface_Method18_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  internal::UnionA_Data param0;

 private:
  friend class mojo::internal::MessageFragment<ConformanceTestInterface_Method18_Params_Data>;

  ConformanceTestInterface_Method18_Params_Data();
  ~ConformanceTestInterface_Method18_Params_Data() = delete;
};
static_assert(sizeof(ConformanceTestInterface_Method18_Params_Data) == 24,
              "Bad sizeof(ConformanceTestInterface_Method18_Params_Data)");
class  ConformanceTestInterface_Method19_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::Recursive_Data> recursive;

 private:
  friend class mojo::internal::MessageFragment<ConformanceTestInterface_Method19_Params_Data>;

  ConformanceTestInterface_Method19_Params_Data();
  ~ConformanceTestInterface_Method19_Params_Data() = delete;
};
static_assert(sizeof(ConformanceTestInterface_Method19_Params_Data) == 16,
              "Bad sizeof(ConformanceTestInterface_Method19_Params_Data)");
class  ConformanceTestInterface_Method20_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Map_Data<mojo::internal::Pointer<internal::StructB_Data>, uint8_t>> param0;

 private:
  friend class mojo::internal::MessageFragment<ConformanceTestInterface_Method20_Params_Data>;

  ConformanceTestInterface_Method20_Params_Data();
  ~ConformanceTestInterface_Method20_Params_Data() = delete;
};
static_assert(sizeof(ConformanceTestInterface_Method20_Params_Data) == 16,
              "Bad sizeof(ConformanceTestInterface_Method20_Params_Data)");
class  ConformanceTestInterface_Method21_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t param0;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<ConformanceTestInterface_Method21_Params_Data>;

  ConformanceTestInterface_Method21_Params_Data();
  ~ConformanceTestInterface_Method21_Params_Data() = delete;
};
static_assert(sizeof(ConformanceTestInterface_Method21_Params_Data) == 16,
              "Bad sizeof(ConformanceTestInterface_Method21_Params_Data)");
class  ConformanceTestInterface_Method22_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t param0;
  uint8_t padfinal_[4];

 private:
  friend class mojo::internal::MessageFragment<ConformanceTestInterface_Method22_Params_Data>;

  ConformanceTestInterface_Method22_Params_Data();
  ~ConformanceTestInterface_Method22_Params_Data() = delete;
};
static_assert(sizeof(ConformanceTestInterface_Method22_Params_Data) == 16,
              "Bad sizeof(ConformanceTestInterface_Method22_Params_Data)");
class  IntegrationTestInterface_Method0_Params_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::BasicStruct_Data> param0;

 private:
  friend class mojo::internal::MessageFragment<IntegrationTestInterface_Method0_Params_Data>;

  IntegrationTestInterface_Method0_Params_Data();
  ~IntegrationTestInterface_Method0_Params_Data() = delete;
};
static_assert(sizeof(IntegrationTestInterface_Method0_Params_Data) == 16,
              "Bad sizeof(IntegrationTestInterface_Method0_Params_Data)");
class  IntegrationTestInterface_Method0_ResponseParams_Data {
 public:
  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> param0;

 private:
  friend class mojo::internal::MessageFragment<IntegrationTestInterface_Method0_ResponseParams_Data>;

  IntegrationTestInterface_Method0_ResponseParams_Data();
  ~IntegrationTestInterface_Method0_ResponseParams_Data() = delete;
};
static_assert(sizeof(IntegrationTestInterface_Method0_ResponseParams_Data) == 16,
              "Bad sizeof(IntegrationTestInterface_Method0_ResponseParams_Data)");

}  // namespace internal


class BoundsCheckTestInterface_Method0_ParamsDataView {
 public:
  BoundsCheckTestInterface_Method0_ParamsDataView() {}

  BoundsCheckTestInterface_Method0_ParamsDataView(
      internal::BoundsCheckTestInterface_Method0_Params_Data* data,
      mojo::Message* message)
      : data_(data) {}

  bool is_null() const { return !data_; }
  uint8_t param0() const {
    return data_->param0;
  }
 private:
  internal::BoundsCheckTestInterface_Method0_Params_Data* data_ = nullptr;
};



class BoundsCheckTestInterface_Method0_ResponseParamsDataView {
 public:
  BoundsCheckTestInterface_Method0_ResponseParamsDataView() {}

  BoundsCheckTestInterface_Method0_ResponseParamsDataView(
      internal::BoundsCheckTestInterface_Method0_ResponseParams_Data* data,
      mojo::Message* message)
      : data_(data) {}

